{"title":"Gearing up","link":"gear_up","text":"I'm sitting on the floor of my apartment, surrounded by boxes. I've got a chromebook on my lap, drinking a sour ale, and flipping through my passport to once again to look at my recently acquired Ethiopian visa.\n\n\n\nThere is a lot of transition going on right now in my life. The roommates are packing up as we all head our own ways and I'm leaving my job for a few months. On the bright side, Dan and I are finishing the first stage of preparation for our greatest adventure yet.  \n\n\n\n**We're driving from Cape Town to Cairo... on motorcycles.**\n\n\n\nI've never done anything like this before. I travel a lot, but this is further off the beaten path than most people ever get in their whole lives... I'm unreasonably excited. Every waking moment has been consumed with thoughts of this trip since I agreed to do it. That's a good thing though, because a trip like this has required planning. I usually roll off a plane, no plan, nowhere to sleep, not even sure if I need a visa on-arrival or not... It always works out. That isn't going to work on this trip.\n\n\n\nThat being said, we don't have the full trip planned out yet, but we are getting certain documents we know we'll need, the aforementioned Ethiopian Visa being one of them. In many ways this trip is going to be an exercise in patience with bureaucracy - we'll be crossing between 8 - 15 borders all of whom really like paperwork for motor vehicles. We'll be buying our motorcycles in South Africa, which simplifies some paperwork, makes others more difficult (Ex: Carnet de Passages en Douane). I've been scouring Gumtree, the South African version of Craigslist, watching as the right kind of motorcycles appear on the market. We're looking to buy cheap Adventure touring bikes, something along the lines of a Kawasaki KLR650, the sort of bike that can be repaired without too much hassle but also has the power to get us across a continent. I've also been acquiring motorcycle gear, the sort of stuff that is cheaper to buy in the USA than purchase in South Africa where we'd pay the premium for import taxes. Getting motorcycle gear has surprisingly scratched that same itch that building a computer does; it's a game of finding the right balance of money and features coupled with reviews and hardware quality. The only difference is that if you choose incorrectly and happen to crash... you might not be getting up again. I wound up going significantly over-budget on this portion of the trip, but I'm not remorseful, I look like a badass in this gear and I know it'll keep me safe.\n\nI've also been looking at camping gear to get in South Africa. I'm not yet sure if I'll take some of my current stuff with me, but Dan and I are primarily planning on camping. This will introduce a whole new set of challenges I haven't seen on other foreign adventures, some places are safer than others to camp in, mostly because of animals... sometimes because of people.\n\nRegardless, We're both pretty excited and looking forward to getting started. We'll be hanging out in South Africa for a couple of weeks at the start of the trip dealing with another visa and getting acquainted with whatever bikes we wind up buying before heading off to Namibia.","tags":["New York"," Gear"," Planning"],"date":"2017-05-24T02:13:11.601Z","lat":40.71465,"lng":-73.94185}